In [1]:
import psycopg2
import pandas as pd
import numpy as np
import pickle

from db_config import *

In [2]:
params = get_db_params()

In [3]:
conn = psycopg2.connect(**params)

In [4]:
c = conn.cursor()

In [5]:
query = """
SELECT *
FROM orders;
"""

df_orders = pd.read_sql_query(query, conn)

In [6]:
df_orders

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,2266710,206209,prior,10,5,18,29.0
3421079,1854736,206209,prior,11,4,10,30.0
3421080,626363,206209,prior,12,1,12,18.0
3421081,2977660,206209,prior,13,1,12,7.0
3421082,272231,206209,train,14,6,14,30.0

In [7]:
whos

Variable        Type          Data/Info
---------------------------------------
ConfigParser    ABCMeta       <class 'configparser.ConfigParser'>
c               cursor        <cursor object at 0x7f4f856bb450; closed: 0>
conn            connection    <connection object at 0x7<...>st=localhost', closed: 0>
df_orders       DataFrame              order_id  user_i<...>3421083 rows x 7 columns]
get_db_params   function      <function get_db_params at 0x7f4f80759050>
np              module        <module 'numpy' from '/op<...>kages/numpy/__init__.py'>
params          dict          n=4
pd              module        <module 'pandas' from '/o<...>ages/pandas/__init__.py'>
pickle          module        <module 'pickle' from '/o<...>lib/python3.7/pickle.py'>
psycopg2        module        <module 'psycopg2' from '<...>es/psycopg2/__init__.py'>
query           str           \nSELECT *\nFROM orders;\n

In [8]:
filename = "../data/df_orders.pickle"

pickle.dump(df_orders, open(filename, "wb"))

In [9]:
df_orders

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,2266710,206209,prior,10,5,18,29.0
3421079,1854736,206209,prior,11,4,10,30.0
3421080,626363,206209,prior,12,1,12,18.0
3421081,2977660,206209,prior,13,1,12,7.0
3421082,272231,206209,train,14,6,14,30.0

In [10]:
query = """
SELECT *
FROM orders;
"""

df_orders = pd.read_sql_query(query, conn)

In [11]:
df_orders.eval_set.value_counts()

prior    3214874
train     131209
test       75000
Name: eval_set, dtype: int64

In [17]:
df_orders.groupby('user_id').agg('count')

,order_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
user_id,,,,,,
1,11,11,11,11,11,10
2,15,15,15,15,15,14
3,13,13,13,13,13,12
4,6,6,6,6,6,5
5,5,5,5,5,5,4
...,...,...,...,...,...,...
206205,4,4,4,4,4,3
206206,68,68,68,68,68,67
206207,17,17,17,17,17,16
206208,50,50,50,50,50,49
206209,14,14,14,14,14,13

In [21]:
query = """
SELECT *
FROM prior_orders;
"""

df_prior = pd.read_sql_query(query, conn)

In [22]:
df_prior

          order_id  product_id  add_to_cart_order  reordered
0                2       33120                  1          1
1                2       28985                  2          1
2                2        9327                  3          0
3                2       45918                  4          1
4                2       30035                  5          0
...            ...         ...                ...        ...
32434484   3421083       39678                  6          1
32434485   3421083       11352                  7          0
32434486   3421083        4600                  8          0
32434487   3421083       24852                  9          1
32434488   3421083        5020                 10          1

[32434489 rows x 4 columns]

In [24]:
query = """
SELECT *
FROM train_orders;
"""

df_train = pd.read_sql_query(query, conn)

In [25]:
df_train

         order_id  product_id  add_to_cart_order  reordered
0               1       49302                  1          1
1               1       11109                  2          1
2               1       10246                  3          0
3               1       49683                  4          0
4               1       43633                  5          1
...           ...         ...                ...        ...
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

[1384617 rows x 4 columns]

Merge orders w/ df prior